Repository: LuicdLabs/OneMMC
Catalog: src/OneMMC/Strings/*/DiskManagement.resw
Source language: en_us
Languages: zh_tw

# DiskMgmt_Err_DynamicDiskDeprecated
source: Dynamic disk conversion feature is not available in this version. Tips: • Please use Windows Disk Management console (diskmgmt.msc) for conversion • Microsoft has marked dynamic disks as deprecated technology • Consider using Storage Spaces as an alternative solution
zh_tw: 此版本不提供動態磁碟轉換功能。 提示: • 請使用 Windows 磁碟管理主控台 (diskmgmt.msc) 進行轉換 • Microsoft 已將動態磁碟標示為已淘汰的技術 • 可考慮改用儲存空間作為替代方案

# DiskMgmt_Err_DynamicDiskSystemWarning
source: ⚠️ Not recommended to convert system disk to dynamic disk. This operation may cause system boot failure or prevent system upgrades.
zh_tw: ⚠️ 不建議將系統磁碟轉換為動態磁碟。此作業可能導致系統無法開機或無法升級。

# DiskMgmt_Err_InvalidDriveLetter
source: Invalid drive letter
zh_tw: 無效的磁碟機代號

# DiskMgmt_Err_InvalidCurrentDriveLetter
source: Invalid current drive letter
zh_tw: 目前的磁碟機代號無效

# DiskMgmt_Err_InvalidNewDriveLetter
source: Invalid new drive letter
zh_tw: 新的磁碟機代號無效

# DiskMgmt_Err_DriveLetterRange
source: Drive letter must be a single letter from A to Z.
zh_tw: 磁碟機代號必須是 A 到 Z 的單一字母。

# DiskMgmt_Err_DriveLetterSameAsCurrent
source: New drive letter is the same as current.
zh_tw: 新的磁碟機代號與目前的相同。

# DiskMgmt_Err_DriveLetterInUseFormat
source: Drive letter {0}: is already in use.
zh_tw: 磁碟機代號 {0}: 已在使用中。

# DiskMgmt_Err_VolumeInfoWin32Format
source: Unable to get volume information. Win32 Error: {0}
zh_tw: 無法取得磁碟區資訊。Win32 錯誤: {0}

# DiskMgmt_Err_VolumeInfoForWin32Format
source: Unable to get volume information for {0}:. Win32 Error: {1}
zh_tw: 無法取得 {0}: 的磁碟區資訊。Win32 錯誤: {1}

# DiskMgmt_Err_RemoveOldLetterWin32Format
source: Unable to remove old drive letter. Win32 Error: {0}
zh_tw: 無法移除舊的磁碟機代號。Win32 錯誤: {0}

# DiskMgmt_Err_SetNewLetterWin32Format
source: Unable to set new drive letter. Win32 Error: {0}
zh_tw: 無法設定新的磁碟機代號。Win32 錯誤: {0}

# DiskMgmt_Err_SetNewLetterRestoredFormat
source: Unable to set new drive letter. Win32 Error: {0}. Original drive letter restored.
zh_tw: 無法設定新的磁碟機代號。Win32 錯誤: {0}。已還原原本的磁碟機代號。

# DiskMgmt_Err_SetNewLetterRollbackFailedFormat
source: Unable to set new drive letter (Win32 Error: {0}). WARNING: Rollback also failed (Win32 Error: {1}). Volume GUID: {2} - manual intervention required.
zh_tw: 無法設定新的磁碟機代號 (Win32 錯誤: {0})。警告: 還原也失敗 (Win32 錯誤: {1})。磁碟區 GUID: {2} - 需要手動處理。

# DiskMgmt_Err_AssignLetterWin32Format
source: Unable to assign drive letter. Win32 Error: {0}
zh_tw: 無法指派磁碟機代號。Win32 錯誤: {0}

# DiskMgmt_Err_RemovalWin32Format
source: Removal failed. Win32 Error: {0}
zh_tw: 移除失敗。Win32 錯誤: {0}

# DiskMgmt_Err_RemovalFailedFormat
source: Removal failed: {0}
zh_tw: 移除失敗: {0}

# DiskMgmt_Err_OpenDeviceWin32Format
source: Failed to open device: Win32 Error {0}
zh_tw: 無法開啟裝置: Win32 錯誤 {0}

# DiskMgmt_Err_ActionWin32Format
source: {0} failed: Win32 Error {1}
zh_tw: {0} 失敗: Win32 錯誤 {1}

# DiskMgmt_Err_OperationFailedFormat
source: {0} failed: {1}
zh_tw: {0} 失敗: {1}

# DiskMgmt_Err_OperationComFailedFormat
source: {0} failed with COM error: {1}
zh_tw: {0} 失敗，COM 錯誤: {1}

# DiskMgmt_Err_ErrorDuringFormat
source: Error during {0}: {1}
zh_tw: 執行 {0} 時發生錯誤: {1}

# DiskMgmt_Err_FailedFormat
source: Failed: {0}
zh_tw: 失敗: {0}

# DiskMgmt_Err_ErrorCodeFormat
source: Operation failed. Error code: {0} - {1}
zh_tw: 作業失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_ErrorCodeOnlyFormat
source: Operation failed. Error code: {0}
zh_tw: 作業失敗。錯誤碼: {0}

# DiskMgmt_Err_InitializeCodeFormat
source: Initialization failed. Error code: {0} - {1}
zh_tw: 初始化失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_CleanCodeFormat
source: Clean failed. Error code: {0} - {1}
zh_tw: 清理失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_DeletionCodeFormat
source: Deletion failed. Error code: {0} - {1}
zh_tw: 刪除失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_AssignmentCodeFormat
source: Assignment failed. Error code: {0} - {1}
zh_tw: 指派失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_FormattingCodeFormat
source: Formatting failed. Error code: {0} - {1}
zh_tw: 格式化失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_ResizeCodeFormat
source: Resize failed. Error code: {0} - {1}
zh_tw: 調整大小失敗。錯誤碼: {0} - {1}

# DiskMgmt_Err_CreatePartitionCodeFormat
source: Failed to create partition. Error code: {0} - {1}
zh_tw: 無法建立分割區。錯誤碼: {0} - {1}

# DiskMgmt_Err_SizeLimitsCodeFormat
source: Unable to query partition size limits. Error code: {0} - {1}
zh_tw: 無法查詢分割區大小限制。錯誤碼: {0} - {1}

# DiskMgmt_Err_SizeLimitsFormat
source: Unable to query partition size limits: {0}
zh_tw: 無法查詢分割區大小限制: {0}

# DiskMgmt_Err_PathEmpty
source: Path cannot be empty.
zh_tw: 路徑不可為空白。

# DiskMgmt_Err_SizeAtLeast1Mb
source: Size must be at least 1 MB.
zh_tw: 大小至少必須為 1 MB。

# DiskMgmt_Err_FileAlreadyExists
source: File already exists.
zh_tw: 檔案已經存在。

# DiskMgmt_Err_FileNotFoundFormat
source: File not found: {0}
zh_tw: 找不到檔案: {0}

# DiskMgmt_Err_VolumeNotFoundFormat
source: Volume {0}: not found.
zh_tw: 找不到磁碟區 {0}:。

# DiskMgmt_Err_SystemLetterRemovalProhibited
source: Removing system drive letter is strictly prohibited!
zh_tw: 嚴禁移除系統磁碟機代號！

# DiskMgmt_Err_FolderPathEmpty
source: Folder path cannot be empty.
zh_tw: 資料夾路徑不可為空白。

# DiskMgmt_Err_FolderNotEmptyFormat
source: Folder must be empty to be used as a mount point: {0}
zh_tw: 資料夾必須是空的才能做為掛接點: {0}

# DiskMgmt_Err_MountWin32Format
source: Unable to mount volume to folder. Win32 Error: {0}
zh_tw: 無法將磁碟區掛接到資料夾。Win32 錯誤: {0}

# DiskMgmt_Err_FormatAfterCreateFailedFormat
source: Partition created, but formatting failed: {0}
zh_tw: 已建立分割區，但格式化失敗: {0}

# DiskMgmt_Err_CreatePartitionFailedFormat
source: Failed to create partition: {0}
zh_tw: 無法建立分割區: {0}

# DiskMgmt_Err_PartitionNoReference
source: Partition created, but unable to get reference for formatting. Please format manually.
zh_tw: 已建立分割區，但無法取得用於格式化的參考。請手動格式化。

# DiskMgmt_Err_LocatePartitionForFormat
source: Unable to locate partition for formatting - missing disk/partition number.
zh_tw: 找不到要格式化的分割區 - 缺少磁碟/分割區編號。

# DiskMgmt_Err_FormattingErrorFormat
source: Error occurred during formatting: {0}
zh_tw: 格式化期間發生錯誤: {0}

# DiskMgmt_Err_FindPartitionForFormat
source: Unable to find partition for formatting.
zh_tw: 找不到要格式化的分割區。

# DiskMgmt_Err_FindVolumeForFormat
source: Unable to find corresponding volume for formatting.
zh_tw: 找不到要格式化的對應磁碟區。

# DiskMgmt_Err_FallbackFormatFailedFormat
source: Fallback format failed: {0}
zh_tw: 替代格式化方式失敗: {0}

# DiskMgmt_Err_FormattingFailedFormat
source: Formatting failed: {0}
zh_tw: 格式化失敗: {0}

# DiskMgmt_Err_ExtendExceedsFormat
source: Requested extension size exceeds available space. Maximum extendable to: {0}
zh_tw: 要求的延伸大小超過可用空間。最多可延伸至: {0}

# DiskMgmt_Err_ExtendMaxUnknown
source: Unable to determine maximum extendable size. Please specify an explicit size in MB.
zh_tw: 無法判斷最大可延伸大小。請以 MB 指定明確的大小。

# DiskMgmt_Err_ExtensionFailedFormat
source: Extension failed: {0}
zh_tw: 延伸失敗: {0}

# DiskMgmt_Err_ShrinkExceedsPartitionFormat
source: Requested shrink size ({0} MB) exceeds current partition size ({1} MB).
zh_tw: 要求的壓縮大小 ({0} MB) 超過目前的分割區大小 ({1} MB)。

# DiskMgmt_Err_ShrinkExceedsShrinkableFormat
source: Shrink size exceeds shrinkable space. Minimum size: {0}
zh_tw: 壓縮大小超過可壓縮的空間。最小大小: {0}

# DiskMgmt_Err_ShrinkUnsafeFormat
source: Shrink may exceed safe limits. Estimated minimum partition size: {0}.
zh_tw: 壓縮可能超過安全限制。估計的最小分割區大小: {0}。

# DiskMgmt_Err_ShrinkFailedFormat
source: Shrink failed: {0}
zh_tw: 壓縮失敗: {0}

# DiskMgmt_Err_EstimateShrink
source: Unable to estimate shrinkable space.
zh_tw: 無法估計可壓縮的空間。

# DiskMgmt_Err_QueryExtendable
source: Unable to query extendable space. No unallocated space may be available.
zh_tw: 無法查詢可延伸的空間。可能沒有可用的未配置空間。

# DiskMgmt_Err_SystemDiskOperation
source: Cannot perform this operation on system disk. This disk contains the Windows operating system.
zh_tw: 無法對系統磁碟執行此作業。此磁碟包含 Windows 作業系統。

# DiskMgmt_Err_CriticalPartitionsWarning
source: This disk contains critical system partitions (EFI, Recovery partition). Operation may cause system boot failure.
zh_tw: 此磁碟包含重要的系統分割區 (EFI、復原分割區)。此作業可能導致系統無法開機。

# DiskMgmt_Err_SystemPartitionOperationFormat
source: Cannot perform this operation on system partition. Drive "{0}" contains the Windows operating system.
zh_tw: 無法對系統分割區執行此作業。磁碟機 "{0}" 包含 Windows 作業系統。

# DiskMgmt_Ok_LetterChangedFormat
source: Drive letter changed from {0}: to {1}:.
zh_tw: 已將磁碟機代號從 {0}: 變更為 {1}:。

# DiskMgmt_Ok_LetterRemovedFormat
source: Drive letter {0}: removed successfully.
zh_tw: 已成功移除磁碟機代號 {0}:。

# DiskMgmt_Ok_LetterAssignedFormat
source: Drive letter {0}: assigned successfully.
zh_tw: 已成功指派磁碟機代號 {0}:。

# DiskMgmt_Ok_InitializedFormat
source: Disk successfully initialized as {0} format.
zh_tw: 已成功將磁碟初始化為 {0} 格式。

# DiskMgmt_Ok_Online
source: Disk is now online.
zh_tw: 磁碟現已上線。

# DiskMgmt_Ok_Offline
source: Disk is now offline.
zh_tw: 磁碟現已離線。

# DiskMgmt_Ok_ReadOnly
source: Disk set to read-only.
zh_tw: 已將磁碟設為唯讀。

# DiskMgmt_Ok_ReadWrite
source: Disk set to read-write.
zh_tw: 已將磁碟設為可讀寫。

# DiskMgmt_Ok_Cleaned
source: Disk cleaned, all partitions removed.
zh_tw: 已清理磁碟，所有分割區皆已移除。

# DiskMgmt_Ok_VhdCreated
source: Virtual hard disk created successfully.
zh_tw: 已成功建立虛擬硬碟。

# DiskMgmt_Ok_VhdAttached
source: Virtual hard disk attached successfully.
zh_tw: 已成功連接虛擬硬碟。

# DiskMgmt_Ok_VhdDetached
source: Virtual hard disk detached successfully.
zh_tw: 已成功中斷連接虛擬硬碟。

# DiskMgmt_Ok_VolumeCreatedFormat
source: Successfully created {0} volume.
zh_tw: 已成功建立 {0} 磁碟區。

# DiskMgmt_Ok_PartitionDeleted
source: Partition deleted successfully.
zh_tw: 已成功刪除分割區。

# DiskMgmt_Ok_PartitionCreated
source: Partition created successfully.
zh_tw: 已成功建立分割區。

# DiskMgmt_Ok_MarkedActive
source: Partition marked as active.
zh_tw: 已將分割區標示為使用中。

# DiskMgmt_Ok_MountedFormat
source: Volume successfully mounted to {0}.
zh_tw: 已成功將磁碟區掛接到 {0}。

# DiskMgmt_Ok_Formatted
source: Formatting successful.
zh_tw: 格式化成功。

# DiskMgmt_Ok_ExtendedFormat
source: Volume extended successfully. New size: {0}
zh_tw: 已成功延伸磁碟區。新大小: {0}

# DiskMgmt_Ok_ShrunkFormat
source: Volume shrunk successfully by {0} MB.
zh_tw: 已成功將磁碟區壓縮 {0} MB。

# DiskMgmt_Query_NoShrinkable
source: No shrinkable space available.
zh_tw: 沒有可壓縮的空間。

# DiskMgmt_Query_ShrinkableFormat
source: Shrinkable space: {0} MB
zh_tw: 可壓縮空間: {0} MB

# DiskMgmt_Query_ExtendableFormat
source: Extendable space: {0} MB
zh_tw: 可延伸空間: {0} MB

# DiskMgmt_Query_EstimatedShrinkableFormat
source: Estimated shrinkable space: {0} MB (actual may be less due to unmovable files)
zh_tw: 估計的可壓縮空間: {0} MB (因有無法移動的檔案，實際可能較少)

# DiskMgmt_Query_Success
source: Success
zh_tw: 成功

# DiskMgmt_Msft_1
source: Unsupported operation
zh_tw: 不支援的作業

# DiskMgmt_Msft_2
source: Unspecified error
zh_tw: 未指定的錯誤

# DiskMgmt_Msft_3
source: Timeout
zh_tw: 逾時

# DiskMgmt_Msft_4
source: Operation failed
zh_tw: 作業失敗

# DiskMgmt_Msft_5
source: Invalid parameter
zh_tw: 無效的參數

# DiskMgmt_Msft_40002
source: Insufficient resources
zh_tw: 資源不足

# DiskMgmt_Msft_40003
source: Object not found
zh_tw: 找不到物件

# DiskMgmt_Msft_40004
source: Method not supported (The operation is not supported on this object or in this configuration)
zh_tw: 不支援此方法 (此物件或此設定不支援此作業)

# DiskMgmt_Msft_41000
source: Disk not initialized
zh_tw: 磁碟尚未初始化

# DiskMgmt_Msft_41001
source: Disk not ready
zh_tw: 磁碟尚未就緒

# DiskMgmt_Msft_41002
source: Disk in use
zh_tw: 磁碟正在使用中

# DiskMgmt_Msft_41003
source: Volume in use
zh_tw: 磁碟區正在使用中

# DiskMgmt_Msft_41010
source: The specified partition type isn't valid
zh_tw: 指定的分割區類型無效

# DiskMgmt_Msft_41011
source: Only the first 2 TB are usable on MBR disks
zh_tw: MBR 磁碟只能使用前 2 TB

# DiskMgmt_Msft_41012
source: The specified offset isn't valid
zh_tw: 指定的位移無效

# DiskMgmt_Msft_41013
source: Can't convert the style of a disk with data or other known partitions on it
zh_tw: 無法轉換含有資料或其他已知分割區之磁碟的樣式

# DiskMgmt_Msft_41014
source: The disk isn't large enough to support a GPT partition style
zh_tw: 磁碟不夠大，無法支援 GPT 磁碟分割樣式

# DiskMgmt_Msft_41015
source: There is no media in the device
zh_tw: 裝置中沒有媒體

# DiskMgmt_Msft_41017
source: The specified partition layout is invalid
zh_tw: 指定的磁碟分割配置無效

# DiskMgmt_Msft_42002
source: The requested access path is already in use
zh_tw: 要求的存取路徑已在使用中

# DiskMgmt_Msft_42004
source: Cannot assign access paths to hidden partitions
zh_tw: 無法將存取路徑指派給隱藏的分割區

# DiskMgmt_Msft_42007
source: The access path isn't valid
zh_tw: 存取路徑無效

# DiskMgmt_Msft_42008
source: Cannot delete system or boot partition
zh_tw: 無法刪除系統或開機分割區

# DiskMgmt_Msft_UnknownFormat
source: Error code {0}
zh_tw: 錯誤碼 {0}

# DiskMgmt_Vhd_2
source: File not found
zh_tw: 找不到檔案

# DiskMgmt_Vhd_3
source: Path not found
zh_tw: 找不到路徑

# DiskMgmt_Vhd_32
source: File is being used by another process
zh_tw: 檔案正由另一個處理程序使用

# DiskMgmt_Vhd_87
source: Invalid parameter
zh_tw: 無效的參數

# DiskMgmt_Vhd_183
source: File already exists
zh_tw: 檔案已經存在

# DiskMgmt_Vhd_UnknownFormat
source: Error code: {0}
zh_tw: 錯誤碼: {0}

# DiskMgmt_PartName_Efi
source: EFI System Partition
zh_tw: EFI 系統分割區

# DiskMgmt_PartName_Recovery
source: Recovery Partition
zh_tw: 復原分割區

# DiskMgmt_PartName_Msr
source: Microsoft Reserved Partition
zh_tw: Microsoft 保留分割區

# DiskMgmt_Warn_Efi
source: ⚠️ EFI System Partition - This partition is required for boot, do not modify
zh_tw: ⚠️ EFI 系統分割區 - 開機時需要此分割區，請勿修改

# DiskMgmt_Warn_Msr
source: ⚠️ Microsoft Reserved Partition - This partition is required for system operation
zh_tw: ⚠️ Microsoft 保留分割區 - 系統運作需要此分割區

# DiskMgmt_Warn_BiosBoot
source: ⚠️ BIOS Boot Partition - This partition is required for boot
zh_tw: ⚠️ BIOS 開機分割區 - 開機時需要此分割區

# DiskMgmt_Warn_Recovery
source: ⚠️ Recovery Partition - This partition is used for system recovery, do not modify
zh_tw: ⚠️ 復原分割區 - 此分割區用於系統復原，請勿修改

# DiskMgmt_Warn_SystemDriveFormat
source: ⚠️ System Drive ({0}) - Contains Windows operating system
zh_tw: ⚠️ 系統磁碟機 ({0}) - 包含 Windows 作業系統

# DiskMgmt_Warn_BootSystem
source: ⚠️ Boot/System Partition - Contains boot files
zh_tw: ⚠️ 開機/系統分割區 - 包含開機檔案

# DiskMgmt_PartType_System
source: System
zh_tw: 系統

# DiskMgmt_PartType_Reserved
source: Reserved
zh_tw: 保留

# DiskMgmt_PartType_Basic
source: Basic
zh_tw: 基本

# DiskMgmt_PartType_Recovery
source: Recovery
zh_tw: 復原

# DiskMgmt_PartType_LdmMetadata
source: LDM Metadata
zh_tw: LDM 中繼資料

# DiskMgmt_PartType_LdmData
source: LDM Data
zh_tw: LDM 資料

# DiskMgmt_PartType_BiosBoot
source: BIOS Boot
zh_tw: BIOS 開機

# DiskMgmt_PartType_LinuxReserved
source: Linux Reserved
zh_tw: Linux 保留

# DiskMgmt_DiskType_UsbDrive
source: USB Drive
zh_tw: USB 磁碟機

# DiskMgmt_CdromDriveFormat
source: CD-ROM Drive ({0})
zh_tw: CD-ROM 光碟機 ({0})

# DiskMgmt_Ok_CdromEjected
source: CD-ROM ejected successfully.
zh_tw: 已成功退出 CD-ROM。

# DiskMgmt_Ok_CdromLoaded
source: CD-ROM loaded successfully.
zh_tw: 已成功載入 CD-ROM。

# DiskMgmt_Action_Load
source: Load
zh_tw: 載入
